app/controllers/api/restaurants_controller.rb

  def index
    if params[:search].length > 0
      @restaurants = Restaurant.search(params[:search])
---
SELECT "restaurants".* FROM "restaurants"

  def show
    @restaurant = Restaurant.includes(:reviews).find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]